{
  "page": "Portfolio",
  "content": "<div id=\"project1\" class=\"project\">\n    <h2>Navigation</h2>\n    <p>Press the \"Next\" or \"Back\" buttons to see my various projects in my portfolio.</p>\n</div>\n\n<div hidden id=\"project2\" class=\"project\">\n    <h2>Wasspord</h2>\n    <img src=\"../misc/Wasspord.png\" alt=\"Wasspord\" id=\"simage\">\n    <a href=\"https://github.com/tannerghosen/Wasspord\">GitHub Repo</a>\n    <p>This is a password management program made using WinForms in C# & .NET. The program saves account info added to this program in a .wasspord file with a user's name of choice. Attached to these files can be a password to unlock the file for future use. All passwords, including the one to unlock the program, are encrypted into the file so that it cannot be easily decrypted without the program. As bonus features, Wasspord comes with a password generator, password validator, miscellaneous settings, and autosaving functionality.</p>\n</div>\n\n<div id=\"project3\" class=\"project\" hidden>\n    <h2>Game Library App</h2>\n    <img src=\"../misc/GameLibraryApp.png\" alt=\"GLA\" id=\"simage\">\n    <a href=\"https://github.com/tannerghosen/GameLibraryApp\">GitHub Repo</a>\n    <p>This is a .NET MAUI / Blazor hybrid application that displays general statistics about your library, such as playtime and achievements. As of this time it only supports Steam, but more platforms are planned.</p>\n</div>\n\n<div hidden id=\"project4\" class=\"project\">\n    <h2>Password Generator API</h2>\n    <a href=\"https://github.com/tannerghosen/PasswordGeneratorAPI\">GitHub Repo</a>\n    <p>This is a Password Generator API created with Express.js, Node.js and JavaScript. It can generate a randomly generated password of either a pre-determined or custom length, and sends back a JSON response containing it. Also includes a form of validation against a basic regex as an additional feature.</p>\n</div>\n\n<div hidden id=\"project5\" class=\"project\">\n    <h2>Other Projects</h2>\n    <p>Other projects I've worked on and things I've practiced with can be found in my GitHub account, which is linked above alongside the page links at the top of the screen.</p>\n</div>",
  "projects": 5
}